{"identifier":9631204,"ep:Repository":9,"dc:type":["Thesis","NonPeerReviewed"],"bibo:shortTitle":"Is social work education life changing?: a unitary appreciative inquiry into the impact of social work education on a person\u0027s beliefs, values and behaviour.","bibo:abstract":"As a Doctorate in Professional Practice, this thesis documents my personal, professional and academic development, within the field of social work education. I reflect on the current context of social work education; underpinning educational theory, research approaches and my educational practice, to find methods which are congruent with my social work values. My learning is informed by the research component of this thesis. This was conducted as a unitary appreciative inquiry which recognises “human wholeness and uniqueness” (Cowling 2004a, p202). The inquiry explores the impact of social work education on five people within the context of their lives. The findings, presented as a unitary appreciative profile (Cowling 2004b), highlight changes to the participants themselves, their relationships with others and the way they view the world. Participants talked of “seeing oppression everywhere”, experiencing changes to their value base, developing different or broader perspectives, being more knowledgeable and recognising the influence of their upbringing, background and culture on the views and beliefs they held. They reflected on learning from a wide range of experiences outside of the classroom and the influence of these on their social work practice and their personal and professional development. As a researcher and a social work educator, the findings opened my eyes to the extent to which qualifying social work education could be life changing. It led me to consider how this impact could be acknowledged more explicitly within social work education and utilised to enhance the experience for students as well as for the outcomes of the profession. This has led to an increased emphasis, in my own practice, on fostering criticality, reflexivity, curiosity and resilience, to enable learners to respond to the ever changing nature of social work practice. These are explored in the practice development component of this thesis and through the development of a new model of pract","bibo:AuthorList":["Hughes, Mel"],"dc:date":"2012","bibo:cites":[],"bibo:citedBy":[],"similarities":[]}